# Lab - 3 - Data Exploration

### 1)  First, you need to read the titanic dataset from local disk and display first five records

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 2)  Identify Nominal, Ordinal, Binary and Numeric attributes from data sets and display all values.

In [4]:
# Nominal order does not matter;
df["Name"]

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [5]:
# ordinal in which some order matters
df["Pclass"]

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [6]:
# Binary attribute
df["SibSp"]

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    1
889    0
890    0
Name: SibSp, Length: 891, dtype: int64

### 3)  Identify symmetric and asymmetric binary attributes from data sets and display all values.

In [7]:
#Symmetric and asymmetric binary attributes

In [8]:
# symmetric
df["Sex"]

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [9]:
# asymmetric
df["Survived"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

### 4)  For each quantitative attribute, calculate its average, standard deviation, minimum, mode, range and maximum values.

In [10]:
from pandas.api.types import is_numeric_dtype
for a in df.columns:
    if(is_numeric_dtype(df[a])):
        print(a)
        print("mean",df[a].mean())
        print("mode",df[a].mode())
        print("median",df[a].median())
        print("max",df[a].max())
        print("min",df[a].min())
        print("standard deviation",df[a].std())
        print("range",range(df[a].min(),df[a].max()))
        print()

PassengerId
mean 446.0
mode 0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: int64
median 446.0
max 891
min 1
standard deviation 257.3538420152301
range range(1, 891)

Survived
mean 0.3838383838383838
mode 0    0
Name: Survived, dtype: int64
median 0.0
max 1
min 0
standard deviation 0.4865924542648585
range range(0, 1)

Pclass
mean 2.308641975308642
mode 0    3
Name: Pclass, dtype: int64
median 3.0
max 3
min 1
standard deviation 0.8360712409770513
range range(1, 3)

Age
mean 29.69911764705882
mode 0    24.0
Name: Age, dtype: float64
median 28.0
max 80.0
min 0.42
standard deviation 14.526497332334044

TypeError: 'float' object cannot be interpreted as an integer

### 6)  For the qualitative attribute (class), count the frequency for each of its distinct values.

In [ ]:
df

###  7) It is also possible to display the summary for all the attributes simultaneously in a table using the describe() function. If an attribute is quantitative, it will display its mean, standard deviation and various quantiles (including minimum, median, and maximum) values. If an attribute is qualitative, it will display its number of unique values and the top (most frequent) values.

### 8)  For multivariate statistics, you can compute the covariance and correlation between pairs of attributes.

### 9) Display the histogram for Age attribute by discretizing it into 8 separate bins and counting the frequency for each bin.

### 10) A boxplot can also be used to show the distribution of values for each attribute.

In [ ]:
df["Age"].hist(bins=10)

### 11)  Display scatter plot for any 5 pair of attributes , we can use a scatter plot to visualize their joint distribution.